; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob4470) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate11)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate12)
	(at pallet4 distributor1)
	(clear crate10)
	(at pallet5 distributor2)
	(clear crate8)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 distributor1)
	(clear pallet7)
	(at pallet8 distributor0)
	(clear crate6)
	(at pallet9 distributor1)
	(clear crate9)
	(at truck0 depot2)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor0)
	(on crate0 pallet8)
	(at crate1 distributor1)
	(on crate1 pallet9)
	(at crate2 distributor1)
	(on crate2 pallet4)
	(at crate3 distributor1)
	(on crate3 crate1)
	(at crate4 distributor1)
	(on crate4 crate3)
	(at crate5 distributor1)
	(on crate5 crate2)
	(at crate6 distributor0)
	(on crate6 crate0)
	(at crate7 distributor1)
	(on crate7 crate4)
	(at crate8 distributor2)
	(on crate8 pallet5)
	(at crate9 distributor1)
	(on crate9 crate7)
	(at crate10 distributor1)
	(on crate10 crate5)
	(at crate11 depot1)
	(on crate11 pallet1)
	(at crate12 distributor0)
	(on crate12 pallet3)
)

(:goal (and
		(on crate0 crate6)
		(on crate1 pallet7)
		(on crate2 pallet5)
		(on crate3 crate1)
		(on crate4 crate2)
		(on crate5 pallet8)
		(on crate6 crate4)
		(on crate7 pallet9)
		(on crate8 pallet4)
		(on crate9 pallet2)
		(on crate10 crate3)
		(on crate11 crate8)
		(on crate12 crate9)
	)
))

; plan
1. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 1 of 13
2. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 1 of 13
3. (lift hoist4 crate9 crate7 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 crate7)
   added: (lifting hoist4 crate9) (clear crate7)
   goals met: 1 of 13
4. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   goals met: 1 of 13
5. (lift hoist4 crate10 crate5 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate5)
   added: (lifting hoist4 crate10) (clear crate5)
   goals met: 1 of 13
6. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 1 of 13
7. (unload hoist2 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist2)
   added: (lifting hoist2 crate9)
   goals met: 1 of 13
8. (drop hoist2 crate9 pallet2 depot2)
   deleted: (lifting hoist2 crate9) (clear pallet2)
   added: (available hoist2) (at crate9 depot2) (clear crate9) (on crate9 pallet2)
   goals met: 2 of 13
9. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 2 of 13
10. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 2 of 13
11. (lift hoist3 crate12 pallet3 distributor0)
   deleted: (at crate12 distributor0) (clear crate12) (available hoist3) (on crate12 pallet3)
   added: (lifting hoist3 crate12) (clear pallet3)
   goals met: 2 of 13
12. (load hoist3 crate12 truck0 distributor0)
   deleted: (lifting hoist3 crate12)
   added: (in crate12 truck0) (available hoist3)
   goals met: 2 of 13
13. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 2 of 13
14. (unload hoist2 crate12 truck0 depot2)
   deleted: (in crate12 truck0) (available hoist2)
   added: (lifting hoist2 crate12)
   goals met: 2 of 13
15. (drop hoist2 crate12 crate9 depot2)
   deleted: (lifting hoist2 crate12) (clear crate9)
   added: (available hoist2) (at crate12 depot2) (clear crate12) (on crate12 crate9)
   goals met: 3 of 13
16. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 3 of 13
17. (lift hoist1 crate11 pallet1 depot1)
   deleted: (at crate11 depot1) (clear crate11) (available hoist1) (on crate11 pallet1)
   added: (lifting hoist1 crate11) (clear pallet1)
   goals met: 3 of 13
18. (load hoist1 crate11 truck1 depot1)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck1) (available hoist1)
   goals met: 3 of 13
19. (drive truck1 depot1 distributor0)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor0)
   goals met: 3 of 13
20. (drive truck1 distributor0 distributor2)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor2)
   goals met: 3 of 13
21. (unload hoist5 crate11 truck1 distributor2)
   deleted: (in crate11 truck1) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 3 of 13
22. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 3 of 13
23. (drop hoist4 crate10 crate7 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate7)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate7)
   goals met: 3 of 13
24. (lift hoist4 crate5 crate2 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist4) (on crate5 crate2)
   added: (lifting hoist4 crate5) (clear crate2)
   goals met: 3 of 13
25. (load hoist4 crate5 truck1 distributor1)
   deleted: (lifting hoist4 crate5)
   added: (in crate5 truck1) (available hoist4)
   goals met: 3 of 13
26. (lift hoist4 crate2 pallet4 distributor1)
   deleted: (at crate2 distributor1) (clear crate2) (available hoist4) (on crate2 pallet4)
   added: (lifting hoist4 crate2) (clear pallet4)
   goals met: 3 of 13
27. (load hoist4 crate2 truck1 distributor1)
   deleted: (lifting hoist4 crate2)
   added: (in crate2 truck1) (available hoist4)
   goals met: 3 of 13
28. (lift hoist4 crate10 crate7 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate7)
   added: (lifting hoist4 crate10) (clear crate7)
   goals met: 3 of 13
29. (drop hoist5 crate11 crate8 distributor2)
   deleted: (lifting hoist5 crate11) (clear crate8)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 crate8)
   goals met: 4 of 13
30. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 4 of 13
31. (unload hoist5 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist5)
   added: (lifting hoist5 crate2)
   goals met: 4 of 13
32. (drop hoist5 crate2 crate11 distributor2)
   deleted: (lifting hoist5 crate2) (clear crate11)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 crate11)
   goals met: 4 of 13
33. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 4 of 13
34. (lift hoist3 crate6 crate0 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 crate0)
   added: (lifting hoist3 crate6) (clear crate0)
   goals met: 4 of 13
35. (load hoist3 crate6 truck1 distributor0)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck1) (available hoist3)
   goals met: 4 of 13
36. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 4 of 13
37. (lift hoist3 crate0 pallet8 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet8)
   added: (lifting hoist3 crate0) (clear pallet8)
   goals met: 4 of 13
38. (drop hoist4 crate10 crate7 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate7)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate7)
   goals met: 4 of 13
39. (unload hoist4 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist4)
   added: (lifting hoist4 crate6)
   goals met: 4 of 13
40. (drop hoist4 crate6 crate10 distributor1)
   deleted: (lifting hoist4 crate6) (clear crate10)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 crate10)
   goals met: 4 of 13
41. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 4 of 13
42. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 4 of 13
43. (drive truck1 distributor2 distributor0)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor0)
   goals met: 4 of 13
44. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 4 of 13
45. (drop hoist3 crate0 pallet8 distributor0)
   deleted: (lifting hoist3 crate0) (clear pallet8)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 pallet8)
   goals met: 4 of 13
46. (lift hoist4 crate6 crate10 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 crate10)
   added: (lifting hoist4 crate6) (clear crate10)
   goals met: 4 of 13
47. (load hoist4 crate6 truck1 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck1) (available hoist4)
   goals met: 4 of 13
48. (lift hoist4 crate10 crate7 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate7)
   added: (lifting hoist4 crate10) (clear crate7)
   goals met: 4 of 13
49. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 4 of 13
50. (unload hoist5 crate6 truck1 distributor2)
   deleted: (in crate6 truck1) (available hoist5)
   added: (lifting hoist5 crate6)
   goals met: 4 of 13
51. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 4 of 13
52. (drop hoist5 crate6 crate2 distributor2)
   deleted: (lifting hoist5 crate6) (clear crate2)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 crate2)
   goals met: 4 of 13
53. (lift hoist3 crate0 pallet8 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet8)
   added: (lifting hoist3 crate0) (clear pallet8)
   goals met: 4 of 13
54. (load hoist3 crate0 truck0 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   goals met: 4 of 13
55. (drive truck1 distributor1 distributor0)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor0)
   goals met: 4 of 13
56. (unload hoist3 crate5 truck1 distributor0)
   deleted: (in crate5 truck1) (available hoist3)
   added: (lifting hoist3 crate5)
   goals met: 4 of 13
57. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 4 of 13
58. (drop hoist3 crate5 pallet8 distributor0)
   deleted: (lifting hoist3 crate5) (clear pallet8)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 pallet8)
   goals met: 5 of 13
59. (drive truck0 distributor0 distributor2)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor2)
   goals met: 5 of 13
60. (lift hoist5 crate6 crate2 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 crate2)
   added: (lifting hoist5 crate6) (clear crate2)
   goals met: 5 of 13
61. (load hoist5 crate6 truck0 distributor2)
   deleted: (lifting hoist5 crate6)
   added: (in crate6 truck0) (available hoist5)
   goals met: 5 of 13
62. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 5 of 13
63. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 5 of 13
64. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 5 of 13
65. (drop hoist0 crate6 pallet0 depot0)
   deleted: (lifting hoist0 crate6) (clear pallet0)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 pallet0)
   goals met: 5 of 13
66. (load hoist4 crate10 truck1 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck1) (available hoist4)
   goals met: 5 of 13
67. (lift hoist4 crate7 crate4 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 crate4)
   added: (lifting hoist4 crate7) (clear crate4)
   goals met: 5 of 13
68. (load hoist4 crate7 truck1 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck1) (available hoist4)
   goals met: 5 of 13
69. (lift hoist4 crate4 crate3 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 crate3)
   added: (lifting hoist4 crate4) (clear crate3)
   goals met: 5 of 13
70. (load hoist4 crate4 truck1 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck1) (available hoist4)
   goals met: 5 of 13
71. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 5 of 13
72. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 5 of 13
73. (unload hoist5 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 5 of 13
74. (drop hoist5 crate4 crate2 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate2)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate2)
   goals met: 6 of 13
75. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 6 of 13
76. (unload hoist4 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist4)
   added: (lifting hoist4 crate10)
   goals met: 6 of 13
77. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 6 of 13
78. (drop hoist4 crate10 crate3 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate3)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate3)
   goals met: 7 of 13
79. (drop hoist0 crate0 crate6 depot0)
   deleted: (lifting hoist0 crate0) (clear crate6)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate6)
   goals met: 8 of 13
80. (lift hoist5 crate4 crate2 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 crate2)
   added: (lifting hoist5 crate4) (clear crate2)
   goals met: 7 of 13
81. (load hoist5 crate4 truck0 distributor2)
   deleted: (lifting hoist5 crate4)
   added: (in crate4 truck0) (available hoist5)
   goals met: 7 of 13
82. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 7 of 13
83. (unload hoist0 crate4 truck0 depot0)
   deleted: (in crate4 truck0) (available hoist0)
   added: (lifting hoist0 crate4)
   goals met: 7 of 13
84. (drop hoist0 crate4 crate0 depot0)
   deleted: (lifting hoist0 crate4) (clear crate0)
   added: (available hoist0) (at crate4 depot0) (clear crate4) (on crate4 crate0)
   goals met: 7 of 13
85. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 7 of 13
86. (lift hoist5 crate2 crate11 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 crate11)
   added: (lifting hoist5 crate2) (clear crate11)
   goals met: 7 of 13
87. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 7 of 13
88. (lift hoist5 crate11 crate8 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist5) (on crate11 crate8)
   added: (lifting hoist5 crate11) (clear crate8)
   goals met: 6 of 13
89. (load hoist5 crate11 truck0 distributor2)
   deleted: (lifting hoist5 crate11)
   added: (in crate11 truck0) (available hoist5)
   goals met: 6 of 13
90. (lift hoist5 crate8 pallet5 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet5)
   added: (lifting hoist5 crate8) (clear pallet5)
   goals met: 6 of 13
91. (load hoist5 crate8 truck0 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck0) (available hoist5)
   goals met: 6 of 13
92. (unload hoist5 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist5)
   added: (lifting hoist5 crate2)
   goals met: 6 of 13
93. (drop hoist5 crate2 pallet5 distributor2)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (available hoist5) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 7 of 13
94. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 7 of 13
95. (unload hoist4 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 7 of 13
96. (drop hoist4 crate8 pallet4 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet4)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet4)
   goals met: 8 of 13
97. (unload hoist4 crate11 truck0 distributor1)
   deleted: (in crate11 truck0) (available hoist4)
   added: (lifting hoist4 crate11)
   goals met: 8 of 13
98. (drop hoist4 crate11 crate8 distributor1)
   deleted: (lifting hoist4 crate11) (clear crate8)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 crate8)
   goals met: 9 of 13
99. (unload hoist4 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist4)
   added: (lifting hoist4 crate7)
   goals met: 9 of 13
100. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 9 of 13
101. (drop hoist4 crate7 crate11 distributor1)
   deleted: (lifting hoist4 crate7) (clear crate11)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 crate11)
   goals met: 9 of 13
102. (lift hoist4 crate10 crate3 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate3)
   added: (lifting hoist4 crate10) (clear crate3)
   goals met: 8 of 13
103. (drop hoist4 crate10 crate7 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate7)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate7)
   goals met: 8 of 13
104. (lift hoist4 crate3 crate1 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 crate1)
   added: (lifting hoist4 crate3) (clear crate1)
   goals met: 7 of 13
105. (drop hoist4 crate3 crate10 distributor1)
   deleted: (lifting hoist4 crate3) (clear crate10)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 crate10)
   goals met: 7 of 13
106. (lift hoist4 crate1 pallet9 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet9)
   added: (lifting hoist4 crate1) (clear pallet9)
   goals met: 7 of 13
107. (drop hoist4 crate1 pallet7 distributor1)
   deleted: (lifting hoist4 crate1) (clear pallet7)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 pallet7)
   goals met: 8 of 13
108. (lift hoist4 crate3 crate10 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 crate10)
   added: (lifting hoist4 crate3) (clear crate10)
   goals met: 8 of 13
109. (drop hoist4 crate3 crate1 distributor1)
   deleted: (lifting hoist4 crate3) (clear crate1)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 crate1)
   goals met: 9 of 13
110. (lift hoist4 crate10 crate7 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate7)
   added: (lifting hoist4 crate10) (clear crate7)
   goals met: 9 of 13
111. (drop hoist4 crate10 crate3 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate3)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate3)
   goals met: 10 of 13
112. (lift hoist4 crate7 crate11 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 crate11)
   added: (lifting hoist4 crate7) (clear crate11)
   goals met: 10 of 13
113. (drop hoist4 crate7 pallet9 distributor1)
   deleted: (lifting hoist4 crate7) (clear pallet9)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 pallet9)
   goals met: 11 of 13
114. (lift hoist0 crate4 crate0 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate0)
   added: (lifting hoist0 crate4) (clear crate0)
   goals met: 11 of 13
115. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 11 of 13
116. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 11 of 13
117. (unload hoist5 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 11 of 13
118. (drop hoist5 crate4 crate2 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate2)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate2)
   goals met: 12 of 13
119. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 12 of 13
120. (lift hoist0 crate0 crate6 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 crate6)
   added: (lifting hoist0 crate0) (clear crate6)
   goals met: 11 of 13
121. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 11 of 13
122. (lift hoist0 crate6 pallet0 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 pallet0)
   added: (lifting hoist0 crate6) (clear pallet0)
   goals met: 11 of 13
123. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 11 of 13
124. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 11 of 13
125. (unload hoist5 crate6 truck1 distributor2)
   deleted: (in crate6 truck1) (available hoist5)
   added: (lifting hoist5 crate6)
   goals met: 11 of 13
126. (drop hoist5 crate6 crate4 distributor2)
   deleted: (lifting hoist5 crate6) (clear crate4)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 crate4)
   goals met: 12 of 13
127. (unload hoist5 crate0 truck1 distributor2)
   deleted: (in crate0 truck1) (available hoist5)
   added: (lifting hoist5 crate0)
   goals met: 12 of 13
128. (drop hoist5 crate0 crate6 distributor2)
   deleted: (lifting hoist5 crate0) (clear crate6)
   added: (available hoist5) (at crate0 distributor2) (clear crate0) (on crate0 crate6)
   goals met: 13 of 13
